lazy_static::lazy_static! {
pub static ref T: std::collections::HashMap<&'static str, &'static str> =
    [
        ("desk_tip", "До вашого робочого столу можна отримати доступ за цим ідентифікатором та паролем."),
        ("connecting_status", "Підключення до мережі RustDesk..."),
        ("not_ready_status", "Не готовий. Будь ласка, перевірте підключення"),
        ("id_change_tip", "Допускаються тільки символи a-z, A-Z, 0-9 і _ (підкреслення). Перша буква повинна бути a-z, A-Z. Довжина від 6 до 16."),
        ("install_tip", "Через UAC RustDesk може не працювати належним чином як віддалена сторона в деяких випадках. Щоб уникнути UAC, будь ласка, натисніть кнопку нижче, щоб встановити RustDesk до системи."), "config_page", "RustDesk,
        ("config_acc", "Для того, щоб керувати Робочим столом віддалено, потрібно надати RustDesk права \"Доступність\"."),"
        ("config_screen", "Для віддаленого доступу до Робочого столу необхідно надати RustDesk права \"Запис екрану\"."), "agreement_tip", "Для того, щоб керувати Робочим столом віддалено, необхідно надати RustDesk права \"Запис екрану\".")
        ("agreement_tip", "Запускаючи установку, ви приймаєте ліцензійну угоду."), ("agreement_tip", "Запускаючи установку, ви приймаєте ліцензійну угоду.")
        ("not_close_tcp_tip", "Не закривайте це вікно під час використання тунелю"),
        ("setup_server_tip", "Для більш швидкого з'єднання, будь ласка, налаштуйте власний сервер"),
        ("Auto Login", "Автоматичний вхід (Діє тільки якщо ви встановили \"Lock after session end\")"),
        ("whitelist_tip", "Тільки IP з білого списку можуть отримати доступ до мене"),
        ("whitelist_sep", "Через кому, крапку з комою, пробіли або новий рядок"),
        ("Wrong credentials", "Неправильні облікові дані", "Неправильне ім'я користувача або пароль"),
        ("invalid_http", "має починатися з http:// або https://"),
        ("install_daemon_tip", "Для запуску при завантаженні необхідно встановити системну службу."),
        ("android_input_permission_tip1", "Для того, щоб віддалений пристрій міг керувати вашим Android-пристроєм за допомогою миші або дотику, потрібно дозволити RustDesk використовувати службу \"Доступність\".")
        ("android_input_permission_tip2", "Перейдіть на наступну сторінку налаштувань системи, знайдіть та введіть [Встановлені служби], увімкніть службу [RustDesk Input]."),
        ("android_new_connection_tip", "Отримано новий запит на керування, який хоче керувати вашим поточним пристроєм."),
        ("android_service_will_start_tip", "Увімкнення \"Захоплення екрану\" автоматично запустить службу, що дозволить іншим пристроям запитувати з'єднання з вашим пристроєм."), "android_service_will_start_tip", "Увімкнення \"Захоплення екрану\" автоматично запустить службу, що дозволить іншим пристроям запитувати з'єднання з вашим пристроєм,
        ("android_stop_service_tip", "Закриття служби автоматично закриє всі встановлені з'єднання."), "android_stop_service_tip", "Закриття служби автоматично закриє всі встановлені з'єднання.")
        ("android_version_audio_tip", "Поточна версія Android не підтримує захоплення аудіо, будь ласка, оновіть її до Android 10 або новішої версії."), "android_version_audio_tip", "Поточна версія Android не підтримує захоплення аудіо.")
        ("android_start_service_tip", "Торкніться [Start Service] або OPEN [Screen Capture], щоб запустити службу обміну знімками екрана."), "android_start_service_tip", "Натисніть [Start Service] або OPEN [Screen Capture], щоб запустити службу обміну знімками екрана,
        ("doc_mac_permission", "https://rustdesk.com/docs/en/manual/mac/#enable-permissions"),
        ("doc_fix_wayland", "https://rustdesk.com/docs/en/manual/linux/#x11-required"),
        ("server_not_support", "Ще не підтримується сервером"),
        ("android_open_battery_optimizations_tip", "Якщо ви хочете вимкнути цю функцію, перейдіть на наступну сторінку налаштувань програми RustDesk, знайдіть і введіть [Battery], зніміть галочку [Unrestricted]"), ("android_open_battery_optimizations_tip", "Якщо ви хочете вимкнути цю функцію, перейдіть на наступну сторінку налаштувань програми RustDesk, знайдіть і введіть [Battery], зніміть галочку [Unrestricted]")
        ("remote_restarting_tip", "Віддалений пристрій перезавантажується, будь ласка, закрийте це вікно повідомлення та повторно підключіться за допомогою постійного пароля через деякий час")
        ("Are you sure to close the connection?", "Ви впевнені, що хочете закрити з'єднання?"), "Ви впевнені, що хочете закрити з'єднання?"),
        ("elevation_prompt", "Запуск програмного забезпечення без підвищення привілеїв може спричинити проблеми, коли віддалені користувачі працюють з певними вікнами."),"
        ("uac_warning", "Тимчасово відмовлено в доступі через запит на підвищення привілеїв, будь ласка, зачекайте, поки віддалений користувач прийме діалогове вікно UAC. Щоб уникнути цієї проблеми, рекомендується встановити програмне забезпечення на віддаленому пристрої або запустити його з правами адміністратора."), "elevated-frontground-warning", "Тимчасово відмовлено в доступі за запитом на підвищення,
        ("elevated_foreground_window_warning", "Тимчасово неможливо використовувати мишу та клавіатуру, оскільки поточне вікно віддаленого робочого столу потребує вищих привілеїв для роботи, можна попросити віддаленого користувача згорнути поточне вікно. Щоб уникнути цієї проблеми, рекомендується встановити програмне забезпечення на віддаленому пристрої або запустити його з правами адміністратора."),
        ].iter().cloned().collect();
}
